{"text": " \n \n \nLeuphana Universität Lüneburg  \n \n \n \nWintersemester 2023/2024  \nModul „Methodenorientierte Zugänge zu den Naturwissenschaften „ \nSeminar: „ Applied Algorithms in Estimation and in Control of Technical, Economical, and \nBiological Dynamical Systems “ \nPaolo Mercorelli \n \nEstimation of the Gross Fixed \nKapital using linear \nRegression \n \n \n \n \n \n \nTimo Heyn  \n \n \n \n4. Semester \n \n \n \n \n \n \nMatr-Nr. 3047219                                           timo.f.heyn@stud.leuphana.de  \nJuluis Weber  \n \n \n4.Semester  \nMatr-Nr. 3047688 \n \n \njulius.weber@stud.leuphana.de \n \n \n \n \n \n \nTable of Contents \nTable of Contents .................................................................................................................... \n2 \nAbstract .................................................................................................................................. \n1 \nIntroduction ............................................................................................................................ \n1 \nGeneral ............................................................................................................................... \n1 \nDeterminants of investment ................................................................................................. \n1 \nProblem and Method .............................................................................................................. \n2 \nEstimation and Interpretation .................................................................................................. \n4 \nResults ................................................................................................................................ \n5 \nConclusion .......................................................................................................................... \n7 \nLists ........................................................................................................................................ \n9 \n \n1 \n \nAbstract \nInvestment is a determinant of an economies long run economic growth and therefore \nthe long run economic circumstances of the respective market participants as well. \nTherefor it is a parameter of interest for science and policy. The goal of this paper is \nan estimation model for the Investment rate of a country. To do that we use multiple \nlinear regression models, containing the regressands income and real interest rate with \ndifferent orders. To decide which model is best suited for this problem we use the \nadjusted coefficient of determination, which is aimed to be minimized in order to avoid \noverfitting. \nIntroduction \nGeneral \nThe determinants of long run economic growth, that is output Growth per capita, is one \nof the big topics in macroeconomics. The basic theory is that relative long run output \ngrowth per capita is determined by technological progress (Blanchard, 266 et seq.). \nBut the absolute output growth that results from the relative output growth through \ntechnological advancement, is determined by the level of capital per capita. Which in \nturn depends positively on investment (Blanchard 2020, 238.et seq) “Investment refers \nto all economic activity which involves the use of resources to produce goods and \nservices.” (Muhamed S.Anwer and R.K. Sampath 1999, S. 3) \nLong term economic goals of governments and institutions like central banks, as well \nas the standard of living of the people living in the respective countries, are influenced \nby the investment level. That makes the determinants of investment which are partly \ninfluenced by governments and central banks relevant for them. \nDeterminants of investment \nBasic theory suggests that investment depends positively on income, and negatively \non the real interest rate plus a risk premium (Blanchard 2020, 137 et seq.)Income has \na positive relation with investment as a higher income leads to more available \nresources for investment. A higher real interest rate or risk premium leads to higher \nexplicit or opportunity costs of investments, which lowers investment overall. \n \n2 \n \nAll of these can be directly or indirectly influenced by governments or central banks \nthrough different policies like monetary policy or investment guarantees, and the key \ninterest rate or money supply.  \nIn the Following we will cut out the factor of risk, using the Formula Bader and Malawi  \n(Malawi und Bader 2010, 202 et seq) used. \nGFCFt =  β0 +  β1 Rt +  β2 GDPt +  Ut \nWhich is equal to:  \n𝐺𝑟𝑜𝑠𝑠 𝑓𝑖𝑥𝑒𝑑 𝐾𝑎𝑝𝑖𝑡𝑎𝑙 =  𝐺𝐷𝑃 ∗𝑎1 + 𝑖𝑛𝑡𝑒𝑟𝑒𝑠𝑡 𝑅𝑎𝑡𝑒∗𝑎2 + 𝑎0 \n \nProblem and Method \nAs explained above, the investment level is a significant parameter for decisions of \npolitics and central banks. Because of that we want to build a model which estimates \nthe investment level (proxied by gross capital formation) of a country given its income \nlevel (proxied by GDP per capita) and its real interest rate that in the following. \nTo do that we decided to use a multiple least squared regression model like Bader and \nMalawi did. \nA least squared regression model aims to predict the size of the regressand (Y), which \nis the dependant variable, for some given values of the regressors (X), which are the \nin the regression model included independent variables and determinants of the \nregressand. In order to achieve a prediction as precise as possible the method \nestimates a coefficient β for each independent variable which gives the change in the \nregressand for a unit increase in the regressor c.p.. And an additional constant \ncoefficient β0 which is independent of the regressors values.(Stock/ Watson, 218 et \nseq.) \n𝑌\n𝑖= 𝛽0 + 𝛽1𝑋1 + ⋯+ 𝛽𝑘𝑋𝑘𝑖+ 𝑢𝑖 \nIt does that, using a given data sample drawn from the population of interest containing \nunit values of the regressors and the regressand and determines the coefficients β \nsuch that the sum of squared errors of prediction is minimized for the sample values. \n(Stock/ Watson, 221 et seq.)  \n \n3 \n \n \n \n𝑚𝑖𝑛𝑏0,𝑏1,…,𝑏𝑘∑( û𝑖)2 \n Where:  \nû𝑖= 𝑌\n𝑖−  Ŷ𝑖 \n Ŷ𝑖= ^𝛽0 + ^𝛽1𝑥1 + ⋯+ ^𝛽𝑘𝑖𝑥𝑘𝑖 \n \nIn the case of our problem, the investment level is then the regressand and the income \nand real interest level are the regressors. \nIn order to account for the possibility of a nonlinear reationship between the regressors \nand the regressand we run polynomial regression models additional to the linear \nregression model depicted above. The working of the estimation of the least squared \nregression model stays the same. The difference is that a polynomial model includes \nhigher order versions of the independent variables additional to the linear versions of \nthe independent variables. So while the coefficients β stay linear, the regressors \nthemselves are nonlinear, which leads to a nonlinear marginal effect on the \nregressand. (Stock/ Watson 21, 286 et seq.) \n𝑌\n𝑖= 𝛽0 + 𝛽1𝑋1𝑖+ 𝛽2𝑋1𝑖\n2 + 𝛽3𝑋2𝑖+ 𝛽4𝑋2𝑖\n2 + 𝑢𝑖 \nTo then decide which of the order least squared regression model is best suited to our \npurposes there needs to be an indicator which acts as a decision rule. \nFor that we use the adjusted coefficient of determination or R2 adjusted. It is in essence \nthe same as the regular R2 which gives “the fraction of the sample variance of Y \nexplained by (or predicted by) the regressors” (Stock/ Watson, 223). The difference is \nthat the regular R2 increases when additional variables are added to the model which \nimpacts the comparability between R2 values of different models. The R2 adjusted \ncorrects for property of R2 by correcting the value of R2 downwards with an increasing \nnumber of independent variables. (Stock/ Watson, 223 et seq.) \nThe decision rule is now to pick the order for the least squared regression model with \nthe lowest R2 adjusted. So, to minimize R2 adjusted with respect to the model’s order, \n \n4 \n \nwith the same sample and influence variables, to avoid overfitting. Overfitting describes \na situation in which a model fits the sample data too precisely, capturing noise or \nrandom variations instead of the intended general relationships which leads to poor \nresults when applying the model to units not included in the sample. \n \nWe apply this method to a data sample of the regressors and the regressand. Our \ndata sources are the real interest rate, the gross fixed capital formation, and the GDP. \nThe sources include data for all 195 countries and some summaries of multiple \nvalues, for example, the European Union. The year of the data ranges from 1960 to \n2022. (The World Bank Data 2022a, 2022b, 2022c) To ensure that all countries are \nweighted equally, the summaries of countries were removed from all three data \nsources, so the value of all countries is only counted once. Then one new data sheet \nis created with all three values for all countries for one year. This data sheet is later \nused to calculate the linear regression. For our data, the year 2016 was chosen \nbecause it is still very recent data, but it has fewer countries with empty values than \nmore recent years. After creating the data sheet, all country data with empty values is \nremoved because, without values, the linear regression can’t calculate the \ncoefficients correctly. This leaves 106 countries for the linear regression. \nEstimation and Interpretation \nTo estimate the gross fixed capital, we use this formula: \n𝐺𝑟𝑜𝑠𝑠 𝑓𝑖𝑥𝑒𝑑 𝐾𝑎𝑝𝑖𝑡𝑎𝑙 =  𝐺𝐷𝑃 ∗𝑎1 + 𝑖𝑛𝑡𝑒𝑟𝑒𝑠𝑡 𝑅𝑎𝑡𝑒∗𝑎2 + 𝑎0 \n \nTo calculate the coefficients a0, a1, and a2, we create a matrix with all GDP and \ninterest rate values and an equal amount, so 106. This matrix is called X1. Using the \nlecture-learned formula, we can use X1 to calculate the coefficient and save it in the \nvariable theta (1, 2, 3). \n𝑇ℎ𝑒𝑡𝑎= 𝑖𝑛𝑣(𝑋1′ ∗𝑋1) ∗𝑋1′ ∗𝐺𝐹𝐶; \nTo decide which order of the estimation model is best suited, we calculate R2 and \nadjust R2. We are adjusting R2 with the factors: the number of measured points is \n \n5 \n \n106, N is equal to the order of the polynomial, and the number of coefficients is equal \nto (N*2)+1. So for the first order, the formulas for R2 and R2 adjusted are: \n𝑅_𝑠𝑞𝑢𝑎𝑟𝑒𝑑= 1 −𝑠𝑢𝑚((𝐺𝐹𝐶−(𝑇ℎ𝑒𝑡𝑎(1) ∗𝐺𝐷𝑃+ 𝑇ℎ𝑒𝑡𝑎(2) ∗𝐼𝑅\n+ 𝑇ℎ𝑒𝑡𝑎(3))). ^2)/(𝑠𝑢𝑚((𝐺𝐹𝐶−𝑚𝑒𝑎𝑛(𝐺𝐹𝐶)). ^2)) \nAnd: \n𝑅_𝑠𝑞𝑢𝑎𝑟𝑒𝑑_𝑎𝑑𝑗 \n= 1 −((𝑚−1)/(𝑚−𝑝) ∗𝑠𝑢𝑚((𝐺𝐹𝐶−(𝑇ℎ𝑒𝑡𝑎(1) ∗𝐺𝐷𝑃\n+ 𝑇ℎ𝑒𝑡𝑎(2) ∗𝐼𝑅+ 𝑇ℎ𝑒𝑡𝑎(3))). ^2)/(𝑠𝑢𝑚((𝐺𝐹𝐶\n−𝑚𝑒𝑎𝑛(𝐺𝐹𝐶)). ^2))) \nTo visualize the results, we chose a country at random, Japan, and estimated the gross \nfixed capital using the data and the calculated coefficients. Then we plotted the \nestimated value from the years 2007–2016 (blue line) and the actual measured value \nin the same years (red dots). \nThen we repeated the process with one order higher until we found an R2 adjusted with \na lower value than the previous R2 adjusted while still being positive. To calculate the \ncoefficients and R2 adjusted for a higher order, we add GDPn and interest rate n, with n \nbeing the highest exponent of the order before +1, to the matrix. Then we multiply the \nnewly calculated coefficients with the new variables when calculating R2 adjusted. For \nexample, the calculation of R2 adjusted for the second order: \n𝑅_𝑠𝑞𝑢𝑎𝑟𝑒𝑑_𝑎𝑑𝑗\n= 1 −(𝑚−1)/(𝑚−𝑝) ∗𝑠𝑢𝑚((𝐺𝐹𝐶−(𝑇ℎ𝑒𝑡𝑎(1) ∗𝐺𝐷𝑃. ^2\n+ 𝑇ℎ𝑒𝑡𝑎(2) ∗𝐺𝐷𝑃+ 𝑇ℎ𝑒𝑡𝑎(3) ∗𝐼𝑅. ^2 + 𝑇ℎ𝑒𝑡𝑎(4) ∗𝐼𝑅\n+ 𝑇ℎ𝑒𝑡𝑎(5))). ^2)/(𝑠𝑢𝑚((𝐺𝐹𝐶−𝑚𝑒𝑎𝑛(𝐺𝐹𝐶)). ^2)) \n \nResults  \nFirst Order:  \nR_squared = 0.0044 \nR_squared_adj = -0.0149 \nPlot: \n \n6 \n \n \nFigure 1 First Order: Estimation of Gross fixed Kapital (self-Created Picture) \nSecond Order: \nR_squared = 0.0368 \nR_squared_adj = -0.0013 \n \nFigure 2 Second Order: Estimation of Gross fixed Kapital (self-Created Picture) \nThird order:  \nR_squared = 0.0773 \nR_squared_adj =0.0407 \n \n7 \n \n \nFigure 3 Second Order: Estimation of Gross fixed Kapital (self-Created Picture) \nForth order: \nR_squared = 0.0895 \nR_squared_adj = 0.0534 \n \nFigure 4 Second Order: Estimation of Gross fixed Kapital (self-Created Picture)  \n  \nThe estimation of the first two orders has negative R2 adjusted. The value of the third \norder is lower than the value of the fourth order, so the third order is the best estimation \naccording to our factors. \nConclusion  \nThe correlation between Gross fixed Kapital GDP and interest Rate is strongest with a \nlinear Regression of the third order. However, the measured Value to describe the \n \n8 \n \naccuracy of the correlation R2 adjusted is very low, and when comparing the estimated \nvalue with the actual Value of an Example the model was not able to estimate ups and \ndowns which is an important part of estimation in Economics. This Result contradicts \nthe Formular found by Bader and Malawi. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n9 \n \nLists  \n \nList of Contents \nBlanchard, Olivier (2020): Macroeconomics (international edition). 8e edition: \nPearson. \nMalawi, Ahmad; Bader, Majed (2010): The Impact of Interest Rate on Investment in \nJordan: A Cointegration Analysis. In: eco 24 (1), S. 199–209. DOI: 10.4197/Eco.24-\n1.6. \nMuhamed S.Anwer and R.K. Sampath (1999): INVESTMENT and ECONOMIC \nGROWTH. In: Presented at Western Argricultural Economics Assosiation ANual \nMeting. \nStock/ Watson (21): Introduction to Econometrics, eBook, Global Edition: Pearson. \nThe World Bank Data (2022a): GDP (current US$). Online accessible \nat:13.04.2024.https://data.worldbank.org/indicator/NY.GDP.MKTP.CD.last check on: \nThe World Bank Data (2022b): Gross fixed capital formation (% of GDP). Online \naccessible at https://data.worldbank.org/indicator/NE.GDI.FTOT.ZS, last check on: \n13.04.2024. \nThe World Bank Data (2022c): Real interest rate (%). Online accessible at \nhttps://data.worldbank.org/indicator/FR.INR.RINR?end=2022&start=1986, last check \non: 13.04.2024. \n \n"}